IDEA Open Model
BeamLoadsImportMappingData.CADBeamID Property
Compatible with IDEA StatiCa v 10.1
 CADBeamID
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public int CADBeamID { get; set; }
Public Property CADBeamID As Integer
	Get
	Set
public:
property int CADBeamID {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
BeamLoadsImportMappingData Class
IdeaRS.OpenModel.Connection Namespace